z ='''





================================================================================
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                             *천안 무인 매표소*                               =
=                                                                              =
=                      안녕하세요 천안 무인 매표소입니다.                      =
=                                                                              =
=                                                                              =
=                                                                              =
=                                1. 버스                                       =
=                                                                              =
=                                2. 열차                                       =
=                                                                              =
=                                                                              =
=                                                                              = 
=                                                                              =
=                                                                              =
=                                                                              =
================================================================================
'''
y ='''
================================================================================
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                              * 연령별 금액표 *                               =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                나이               연령              금액                     =
=                                                                              =
=       ************************************************************           =
=                                                                              =
=              6세 미만            영유아             0원                      =
=                                                                              =
=              6세 ~ 12세          어린이             700원                    =
=                                                                              =
=             13세 ~ 18세          청소년             920원                    =
=                                                                              =
=             19세 ~ 64세          어른               1,500원                  =
=                                                                              =
=             65세 이상            노약자             0원                      =
=                                                                              =
=                                                                              =
=                                                                              = 
=           ※ 국가 유공자, 장애인 이용금액은 0원입니다 ※                     =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
================================================================================
'''
x ='''
================================================================================
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                            * 결제 수단 선택 *                                =
=                                                                              =
=                                                                              =
=                                                                              =
=                                1. 카드                                       =
=                                                                              =
=                                2. 현금                                       =
=                                                                              =
=                                                                              = 
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
================================================================================
'''
v = '''
================================================================================
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                              * 연령별 금액표 *                               =
=                                                                              =
=                                                                              =
=                                                                              =
=       - 기본 운임 기준 -                                                     =
=                                                                              =
=                                                                              =
=               나이               연령              금액(기본 운임)           =
=                                                                              =
=      ******************************************************************      =
=                                                                              =
=              6세 미만            영유아             1200원                   =
=                                                                              =
=              6세 ~ 12세          어린이             2400원                   =
=                                                                              =
=             13세 ~ 64세          어른               4800원                   =
=                                                                              =
=              65세 이상           노약자             1440원                   =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              = 
=      ※구간별 추가 운임비용이 있습니다※                                     =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
================================================================================
'''
u = '''
================================================================================
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                            * 열차 방면 선택 *                                =
=                                                                              =
=                                                                              =
=                                                                              =
=                            1. 상행(서울방면)                                 =
=                                                                              =
=                            2. 하행(부산방면)                                 =
=                                                                              =
=                                                                              = 
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
=                                                                              =
================================================================================
'''
s= '''
================================================================================
=                                                                              =
=                                                                              =
=                                                                              =
=                           * 상행 구간별 금액표 *                             =
=                                                                              =
=                                                                              =
=                                                                              =
=       - 성인 기준 -                                                          =
=       - 출발지역 : 천안역/ 화살표 방향으로 운임 -                            =
=                                                                              =
=                              *                                               =
=             도착지역         *                 금액                          =
=                              *                                               =
=      ******************************************************************      =
=                              *                                               =
=              평택            *                4800원(기본운임)               =
=               ↓             *                                               =
=              수원            *                5300원                         =
=               ↓             *                                               =
=             영등포           *                8400원                         =
=               ↓             *                                               =
=              서울            *                9300원                         =
=                              *                                               =
=                                                                              =
=      ※할인율※                                                              =
=                                                                              =
=          6세 미만 유야 : 성인 기준 75%                                       =
=          어린이        : 성인 기준 50%                                       =
=          노약자        : 성인 기준 30%                                       =
=                                                                              =
=                                                                              =
=                                                                              =
================================================================================
'''
r= '''
================================================================================
=                                                                              =
=                                                                              =
=                                                                              =
=                           * 하행 구간별 금액표 *                             =
=                                                                              =
=       - 성인 기준 -                                                          =
=       - 출발지역 : 천안역/ 화살표 방향으로 운임 -                            =
=                                                                              =
=                                                                              =
=             도착지역                           금액                          =
=                                                                              =
=      ******************************************************************      =
=                                                                              =
=             조치원                            4800원(기본운임)               =
=               ↓                                ↓                           =
=             신탄진                            5300원                         =
=               ↓                                ↓                           =
=              대전                             8400원                         =
=               ↓                                ↓                           =
=              영동                             9300원                         =
=               ↓                                ↓                           =
=              김천                             15200원                        =
=               ↓                                ↓                           =
=              구미                             17400원                        =
=               ↓                                ↓                           =
=              왜관                             19200원                        =
=               ↓                                ↓                           =
=              대구                             21800원                        =
=               ↓                                ↓                           =
=             동대구                            22100원                        =
=               ↓                                ↓                           =
=              경산                             23300원                        =
=               ↓                                ↓                           =
=              청도                             25600원                        =
=               ↓                                ↓                           =
=              밀양                             27500원                        =
=               ↓                                ↓                           =
=              물금                             30400원                        =
=               ↓                                ↓                           =
=              구포                             31700원                        =
=               ↓                                ↓                           =
=              부산                             33300원                        = 
=                                                                              =
=                                                                              = 
=      ※할인율※                                                              =
=                                                                              =
=          6세 미만 유야 : 성인 기준 75%                                       =
=          어린이        : 성인 기준 50%                                       =
=          노약자        : 성인 기준 30%                                       =
=                                                                              =
=                                                                              =
================================================================================
'''


#시작#
while True:
    print (z)
    vehicle = int(input('사용하실 이동수단 번호를 입력해주세요. :'))
    if vehicle == 1:
        print (y)
        print ('연령별 탑승 인원수을 입력해주세요!')
        a = int(input('어린이 >>'))
        b = int(input('청소년 >>'))
        c = int(input('어른   >>'))
        d = int(input('노약자, 국가 유공자, 영유아, 장애인 >>'))
        p = (a*700 + b*920 + c*1500 + d*0)
        p1 = (a+b+c+d)
        if p1 == 0 :
            print('탑승자가 없습니다. 다시 시작해주세요.')
        else :
            print (x)
            print ('총 금액은',p,'입니다.')
            how = int(input('결제 수단 번호를 입력해주세요. :'))
            if how ==1:
                v1 = int(input('카드 잔액을 입력해주세요. :'))
                if v1>=p :
                    print ('남은 잔액은',v1-p,'원이며 표는 총',p1,'장 입니다. 이용해주셔서 감사합니다.')
                else :
                    print (p-v1,'원이 부족합니다. 카드를 충전하세요.')
            elif how ==2:
                v2 = int(input('현금을 입력해주세요. :'))
                if v2>=p :
                    print ('남은 잔액은',v2-p,'원이며 표는 총',p1,'장 입니다. 이용해주셔서 감사합니다.')
                else :
                    print (p-v2,'원이 부족합니다. 현금을 더 넣어주세요.')
            else :
                print('결제 수단에 번호가 없습니다. 다시 시작해주세요.')



                
    elif vehicle == 2:
        print (u)
        way = {"평택" : 4800, "수원" : 5300, "영등포" : 8400, "서울" : 9300, "조치원" : 4800, "신탄진" : 5300, " 대전" : 8400, "영동" : 9300,
           "김천" : 15200, "구미" : 17400, "왜관" : 19200, "대구" : 21800, "동대구" : 22100, "경산" : 23300, "청도" : 25600, "밀양" : 27500,
           "물금" : 30400, "구포" : 31700, "부산" : 33300}
        t = int(input('열차 방면 번호를 입력해주세요. :'))
        if t == 1:
            print(v)
            print ('연령별 탑승 인원수을 입력해주세요!')
            a = int(input('영유아 >>'))
            b = int(input('어린이 >>'))
            c = int(input('어른   >>'))
            d = int(input('노약자 >>'))
            p = (a+b+c+d)
            if p == 0 :
                print('탑승자가 없습니다. 다시 시작해주세요.')
            else :
                print (s)
                q = (input('도착 지역을 작성해주세요. :'))
                a1 = int((way[q]-(way[q]*0.75))*a)
                b1 = int((way[q]-(way[q]*0.5))*b)
                c1 = int(way[q]*c)
                d1 = int((way[q]-(way[q]*0.3))*d)
                p1 = (a1+b1+c1+d1)
                print (x)
                print ('총 금액은',p1,'입니다')
                how = int(input('결제 수단 번호를 입력해주세요. :'))
                if how ==1:
                    v1 = int(input('카드 잔액을 입력해주세요. :'))
                    if v1>=p1 :
                        print ('남은 잔액은',v1-p1,'원이며 표는 총',p,'장 입니다. 이용해주셔서 감사합니다.')
                    else :
                        print (p1-v1,'원이 부족합니다. 카드를 충전하세요.')
                elif how ==2:
                    v2 = int(input('현금을 입력해주세요.:'))
                    if v2>=p1 :
                        print ('남은 잔액은',v2-p1,'원이며 표는 총',p,'장 입니다. 이용해주셔서 감사합니다.')
                    else :
                        print (p1-v2,'원이 부족합니다. 현금을 더 넣어주세요.')
                else :
                    print('결제 수단 번호가 없습니다. 다시 시작해주세요.')
        elif t == 2:
            print(v)
            print ('연령별 탑승 인원수을 입력해주세요!')
            a = int(input('영유아 >>'))
            b = int(input('어린이 >>'))
            c = int(input('어른   >>'))
            d = int(input('노약자 >>'))
            p = (a+b+c+d)
            if p == 0 :
                print('탑승자가 없습니다. 다시 시작해주세요')
            else :
                print (r)
                q = (input('도착 지역을 작성해주세요. :'))
                a1 = int((way[q]-(way[q]*0.75))*a)
                b1 = int((way[q]-(way[q]*0.5))*b)
                c1 = int(way[q]*c)
                d1 = int((way[q]-(way[q]*0.3))*d)
                p1 = (a1+b1+c1+d1)
                print (x)
                print ('총 금액은',p1,'입니다')
                how = int(input('결제 수단 번호를 입력해주세요. :'))
                if how ==1:
                    v1 = int(input('카드 잔액을 입력해주세요. : '))
                    if v1>=p1 :
                        print ('남은 잔액은',v1-p1,'원이며 표는 총',p,'장 입니다. 이용해주셔서 감사합니다.')
                    else :
                        print (p1-v1,'원이 부족합니다. 카드를 충전하세요.')
                elif how ==2:
                    v2 = int(input('현금을 입력해주세요. :'))
                    if v2>=p1 :
                        print ('남은 잔액은',v2-p1,'원이며 표는 총',p,'장 입니다. 이용해주셔서 감사합니다.')
                    else :
                        print (p1-v2,'원이 부족합니다. 현금을 더 넣어주세요.')
                else :
                    print('결제 수단에 번호가 없습니다. 다시 시작해주세요.')
    
